* Any
Совместим с любым типом и любой тим совместим с Any
#+begin_src mypy
from typing import Any

a: Any = None
a = []
a = 2

s: str = ''
s = a # Внимание !

def foo(item: Any) -> int:
    item.bar()
    return 3
#+end_src

Любой тип является потомком object и Any, но обратно неверно - вотличии от Any object не является подтипом
любого другого типа.

#+begin_src mypy
from typing import Any

def hash_a(item: object) -> int:
    # Fails type checking; an object does not have a 'magic' method.
    item.magic()
    return 1

def hash_b(item: Any) -> int:
    item.magic()
    return 1

# Passes type checking, since ints and strs are subclasses of object
hash_a(42)
hash_a("foo")

# Passes type checking, since Any is compatible with all types
hash_b(42)
hash_b("foo")
#+end_src

#+RESULTS:
: /tmp/babel-VWgyKs/mypy-VQlhFZ:5: error: "object" has no attribute "magic"  [attr-defined]
: Found 1 error in 1 file (checked 1 source file)

* Type aliases
Для наделения физическим смыслом типов.
Удобно для описания сложных типов.

https://docs.python.org/3/reference/simple_stmts.html#type
Нужно pip install mypy-dev

typing.TypeAlias - deprecated 3.12, нужно использовать type 🤣

#+begin_src mypy
type Vector = list[float] # python3.12, mypy1.11

from typing import TypeAlias # python3.11
Vector2: TypeAlias = list[float]

# From doc:
# The type statement is new in Python 3.12. For backwards compatibility,
# type aliases can also be created through simple assignment:
Vector3 = list[float]
# Врядли такое сделают deprecated в ближайшее время...

def scale(scalar: float, vector: Vector) -> Vector:
    return [scalar * num for num in vector]
#+end_src

Но что такое =list[float]=?

#+begin_src python :results output
# SANDBOX
a = list[str]
print(a, type(a))

#from types import GenericAlias
# https://docs.python.org/3/library/types.html#types.GenericAlias
# Changed in version 3.9.2: This type can now be subclassed.
x = a([1,2,3])
print(x)
#+end_src

#+RESULTS:
: list[str] <class 'types.GenericAlias'>
: [1, 2, 3]

* New type

#+begin_src python :results output
from typing import NewType

# y = NewType(x, int); должно быть y == x
UserId = NewType('UserId', int)
some_id = UserId(524313)

print(some_id, type(UserId), type(some_id))
#+end_src

#+RESULTS:
: 524313 <class 'typing.NewType'> <class 'int'>

Но зачем это нужно и чем это для нас отличается от TypeAlias ???
Как вы думаете, что вернет здесь print ?

#+begin_src python :results output
from typing import NewType

class A:
    def __init__(self, v):
        self._v = v
        print(v)

UserId = NewType('UserId', A)

uid = UserId(3)
print(type(uid))

def func(v: UserId):
    v.val 



class UserId:
   val: int

func(UserId(3))

#+end_src

#+RESULTS:
: <class 'int'>

https://docs.python.org/3/library/typing.html#newtype

* TypeVarTuple, Unpack

TypeVarTuple это как обобщенный тип вроде tuple[T1, T2, T3, ...]

#+begin_src mypy
from typing import TypeVar, TypeVarTuple, Unpack

T = TypeVar("T")
Ts = TypeVarTuple("Ts")


def move_first_element_to_last(tup: tuple[T, Unpack[Ts]]) -> tuple[Unpack[Ts], T]:
    return (*tup[1:], tup[0])


def move_first_element_to_last2(tup: tuple[T, *Ts]) -> tuple[*Ts, T]:
    return (*tup[1:], tup[0])


move_first_element_to_last(tup=(1,))
move_first_element_to_last(tup=(1, 'spam'))
move_first_element_to_last(tup=(1, 'spam', 3.0))
move_first_element_to_last(tup=()) # Тут ошибка! один параметр необходим.
#+end_src

TypeVarTuple всегда используется с Unpack
#+begin_src mypy
x: Ts          # Not valid
x: tuple[Ts]   # Not valid
x: tuple[*Ts]  # The correct way to do it
#+end_src

Можно использовать как generic параметры в классах:

#+begin_src mypy
class Array[DType, *Shape]:
    def __init__(self, shape: tuple[*Shape], dtype: DType):
        self._shape = shape
        self._dtype = dtype

    def __getitem__(self, key: tuple[*Shape]) -> float:
        return 0.1

    def __abs__(self) -> "Array[DType, *Shape]":
        return self

    def get_shape(self) -> tuple[*Shape]:
        return self._shape
#+end_src

Можно в Callable:

#+begin_src mypy
from typing import Callable

def call_soon[*Ts](
    callback: Callable[[*Ts], None],
    *args: *Ts,
) -> None:
    callback(*args)
#+end_src

#+RESULTS:
: Success: no issues found in 1 source file

* collections.abc
[[file:~/.local/share/mise/installs/python/3.12/lib/python3.12/_collections_abc.py::class Hashable(metaclass=ABCMeta):][collections.abc]]
https://docs.python.org/3/library/collections.abc.html
Хорошо параметры функции делать как можно более общими типами, а возвращающее значенее конкретным

#+begin_src mypy
async def func(x: int) -> str:
    return "a"

reveal_type(func)
#+end_src

#+RESULTS:
: /tmp/babel-tLYvnr/mypy-4SNXXI:4: note: Revealed type is "def (x: builtins.int) -> typing.Coroutine[Any, Any, builtins.str]"
: Success: no issues found in 1 source file

#+begin_src mypy
from collections.abc import Reversible

# плохо
def f(x: list[int]) -> list[int]:
    return list(reversed(x))


# хорошо
def f2(x: Reversible[int]) -> list[int]:
    return list(reversed(x))
#+end_src

Nominal vs structural (static duck typing) subtyping

#+begin_src mypy

from collections.abc import Sized, Iterable, Iterator

def collect(items: Iterable[int]) -> int: ...

# Nominal
class Bucket(Sized, Iterable[int]):
    ...
    def __len__(self) -> int: ...
    def __iter__(self) -> Iterator[int]: ...

from collections.abc import Iterator, Iterable

# Structural
class Bucket:  # Note: no base classes
    ...
    def __len__(self) -> int: ...
    def __iter__(self) -> Iterator[int]: ...

result = collect(Bucket())  # Passes type check
#+end_src



Узнал про форму iter(callable, sentinel):
#+begin_src python :results output
a = list(1, 2, 3)

for i in a:
    do(i)
    
iterator = iter(a)

while True:
    try:
        val = next(iterator)
        do(val)
    except StopIteration:
        break


c = 0

def f():
    global c
    c += 1
    return c


for i in iter(f, 3):
    print(i)
#+end_src

#+RESULTS:
: 1
: 2

Можно использовать =__getitem__= для описания iterable
#+begin_src python :results output
class IT:
    d = [0, 1]

    def __getitem__(self, k):
        return self.d[k]


for i in IT():
    print(i)
#+end_src

#+RESULTS:
: 0
: 1

* ParamSpec
#+begin_src mypy
from typing import Callable, ParamSpec, TypeVar

P = ParamSpec("P")
T = TypeVar("T")


def decorator(f: Callable[P, T]) -> Callable[P, T]:
    def inner(*args: P.args, **kwargs: P.kwargs) -> T:
        print("Called with", args, kwargs)
        return f(*args, **kwargs)
    return inner


@decorator
def my_func(x: int, y: str) -> str:
    return y * x
#+end_src

Если в списке переменных **P - то это ParamSpec:

#+begin_src mypy
type IntFunc[**P] = Callable[P, int]

def decorator[T, **P](f: Callable[P, T]) -> Callable[P, T]:
    def inner(*args: P.args, **kwargs: P.kwargs) -> T:
        print("Called with", args, kwargs)
        return f(*args, **kwargs)
    return inner
#+end_src

Может bound, covariant, contravariant
Но это выглядит как ошибка, нет вменяемых причин использовать это:
https://github.com/python/typing/issues/1027
Так как это уже есть в питоне и происходит в runtime, видимо это не уберут.
Хотя мб придумают какие то варианты использования этого...

Есть еще такой трюк🫣 :

#+begin_src mypy
import time
from contextlib import contextmanager
from typing import Any, Callable


@contextmanager
def timing():
    try:
        start = time.time()
        yield
        end = time.time()
    finally:
        print("timing: ", end - start)


@timing()
def f(x: int, *, g: Callable[..., int]) -> float:
    g()
    return 1.1


r = f(1, g=lambda: 3)
assert r == 1.1
reveal_type(f)
#+end_src

#+RESULTS:
: /tmp/babel-VWgyKs/mypy-XNwE24:24: note: Revealed type is "def (x: builtins.int, *, g: def (*Any, **Any) -> builtins.int) -> builtins.float"
: Success: no issues found in 1 source file

* Literal

#+begin_src mypy
from typing import Literal, Any, Final

def validate_simple(data: Any) -> Literal[True]:  # always returns True
    return True


type Mode = Literal['r', 'rb', 'w', 'wb']
def open_helper(file: str, mode: Mode) -> str:
    return "a"

open_helper('/some/path', 'r')      # Passes type check
open_helper('/other/path', 'typo')  # Error in type checker

mode = "wb"
open_helper('/other/path', mode)  # Так к сожалению тоже не работает

mode2: Literal["wb"] = "wb"
open_helper('/other/path', mode2)  # Приходится так...

mode3: Final = "wb"
open_helper('/other/path', mode3)  # Или так...

mode4: Final[str] = "wb"
open_helper('/other/path', mode4)  # А вот так не работает...

#+end_src

#+RESULTS:
: /tmp/babel-VWgyKs/mypy-xaw4C1:12: error: Argument 2 to "open_helper" has incompatible type "Literal['typo']"; expected "Literal['r', 'rb', 'w', 'wb']"  [arg-type]
: /tmp/babel-VWgyKs/mypy-xaw4C1:15: error: Argument 2 to "open_helper" has incompatible type "str"; expected "Literal['r', 'rb', 'w', 'wb']"  [arg-type]
: /tmp/babel-VWgyKs/mypy-xaw4C1:21: error: Argument 2 to "open_helper" has incompatible type "str"; expected "Literal['r', 'rb', 'w', 'wb']"  [arg-type]
: Found 3 errors in 1 file (checked 1 source file)

* ClassVar

#+begin_src mypy
from typing import ClassVar

class Starship:
    stats: ClassVar[dict[str, int]] = {} # class variable
    damage: int = 10                     # instance variable

enterprise_d = Starship()
enterprise_d.stats = {} # Error, setting class variable on instance
Starship.stats = {}     # This is OK
#+end_src

#+RESULTS:
: /tmp/babel-VWgyKs/mypy-disJsW:8: error: Cannot assign to class variable "stats" via instance  [misc]
: Found 1 error in 1 file (checked 1 source file)

* TypedDict
Для типизации dict -а очень полезная штука

#+begin_src mypy
# Лучше всего использовать class syntax, но не всегда это возможно:
class Point2D(TypedDict):
    in: int
    x-y: int

# OK, functional syntax
Point2D = TypedDict('Point2D', {'in': int, 'x-y': int})
#+end_src

Вместе с Unpack используется для аннотации kwargs

#+begin_src mypy
from typing import TypedDict, Unpack

class Movie(TypedDict):
    name: str
    year: int

def foo(**kwargs: Unpack[Movie]) -> None: 
    return None

foo(name=3)
#+end_src

#+RESULTS:
: /tmp/babel-VWgyKs/mypy-2gLpd4:10: error: Missing named argument "year" for "foo"  [call-arg]
: /tmp/babel-VWgyKs/mypy-2gLpd4:10: error: Argument "name" to "foo" has incompatible type "int"; expected "str"  [arg-type]
: Found 2 errors in 1 file (checked 1 source file)

* overload, get_overloads, clear_overloads

#+begin_src python :results output
from typing import get_overloads, overload, clear_overloads

@overload
def process(response: None) -> None:
    ...
@overload
def process(response: int) -> tuple[int, str]:
    ...
@overload
def process(response: bytes) -> str:
    ...
def process(response):
    ...  # actual implementation goes here


print(get_overloads(process))
clear_overloads()
print(get_overloads(process))
#+end_src

#+RESULTS:
: [<function process at 0x7fcb5b10a340>, <function process at 0x7fcb5ae41d00>, <function process at 0x7fcb5ae41ee0>]
: []

* no_type_check
#+begin_src mypy
from typing import no_type_check

@no_type_check
def a(self) -> int:
    return "string"
#+end_src

#+RESULTS:
: Success: no issues found in 1 source file

* type_check_only
Используется в stub файлах. В runtime эта функция недоступна.

#+begin_src mypy
from typing import type_check_only

@type_check_only
class Response:  # private or not available at runtime
    code: int
    def get_header(self, name: str) -> str:
        return "a"

def fetch_response() -> Response:
    return Response()
#+end_src

#+RESULTS:
: Success: no issues found in 1 source file

